readme.org
#+STARTUP: fold
#+STARTUP: hidestars

* 0 install
  Install config:
  #+BEGIN_SRC shell :tangle no
    git clone --depth=1 git@github.com:firslov/.emacs.d.git
  #+END_SRC
  Rebuild config:
  #+BEGIN_SRC emacs-lisp :tangle no
    (org-babel-tangle-file "~/.emacs.d/readme.org")
  #+END_SRC
* 1 structure
  The structure of config files:
  - [[file:./init.el][init.el]]
    - init-sys.el
    - init-roam.el
    - init-package.el
    - init-user.el
    - init-org.el
* 2 init
  The init file:
  #+BEGIN_SRC emacs-lisp :tangle init.el
    ;;; init.el --- The main entry for emacs -*- lexical-binding: t -*-

    ;; A big contributor to startup times is garbage collection. We up the gc
    ;; threshold to temporarily prevent it from running, and then reset it later
    ;; using a hook.
    (setq gc-cons-threshold most-positive-fixnum
	  gc-cons-percentage 0.6)

    ;; Keep a ref to the actual file-name-handler
    (defvar default-file-name-handler-alist file-name-handler-alist)

    ;; Set the file-name-handler to nil (because regexing is cpu intensive)
    (setq file-name-handler-alist nil)

    ;; Reset file-name-handler-alist after initialization
    (add-hook 'emacs-startup-hook
	      (lambda ()
		(setq gc-cons-threshold 16777216
		      gc-cons-percentage 0.1
		      file-name-handler-alist default-file-name-handler-alist)))

    ;; Package
    (require 'package)
    (package-initialize)
    (setq package-archives '(("gnu"   . "http://elpa.emacs-china.org/gnu/")
			     ("melpa" . "http://elpa.emacs-china.org/melpa/")))
    ;; Add Packages
    (defvar my/packages '(
			  helm-swoop
			  htmlize
			  atom-one-dark-theme
			  solarized-theme
			  org2ctex
			  org-roam-bibtex
			  org-ref
			  f
			  all-the-icons
			  ) "Default packages")

    (setq package-selected-packages my/packages)

    (defun my/packages-installed-p ()
      (cl-loop for pkg in my/packages
	       when (not (package-installed-p pkg)) return nil
	       finally return t))

    (unless (my/packages-installed-p)
      (message "%s" "Refreshing package database...")
      (package-refresh-contents)
      (dolist (pkg my/packages)
	(when (not (package-installed-p pkg))
	  (package-install pkg))))

    ;; Bootstrap `use-package'
    (unless (package-installed-p 'use-package)
      (package-refresh-contents)
      (package-install 'use-package))
    (eval-and-compile
      (setq use-package-always-ensure nil)
      (setq use-package-always-defer nil)
      (setq use-package-always-demand nil)
      (setq use-package-expand-minimally nil)
      (setq use-package-enable-imenu-support t))
    (eval-when-compile
      (require 'use-package))


    (setq debug-on-error t)
    (setq-default lexical-binding t)

    (add-to-list 'load-path (expand-file-name "lisp" user-emacs-directory))
    (setq custom-file (expand-file-name "custom.el" user-emacs-directory))

    (require 'init-sys)
    (require 'init-roam)
    (require 'init-package)
    (require 'init-user)
    (require 'init-org)

    (provide 'init)
    ;;; init.el ends here
  #+END_SRC
* 3 system
  The different system entries:
** windiows
   #+BEGIN_SRC emacs-lisp :tangle lisp/init-sys.el
     (when (eq system-type 'windows-nt)
       (setq org-directory "e:/org/"
	     org-roam-directory org-directory))
   #+END_SRC
** macos
   #+BEGIN_SRC emacs-lisp :tangle lisp/init-sys.el
     (when (eq system-type 'darwin)
       (setq org-directory "~/firslov"
	     org-roam-directory org-directory))
   #+END_SRC
** linux
   #+BEGIN_SRC emacs-lisp :tangle lisp/init-sys.el
     (when (eq system-type 'gnu/linux)
       (setq org-directory "~/org/"
	     org-roam-directory org-directory))
   #+END_SRC
** provide
   #+BEGIN_SRC emacs-lisp :tangle lisp/init-sys.el
     (provide 'init-sys)
   #+END_SRC
