lisp/init-package.el
;; Add Packages
(defvar my/packages '(
		      helm-swoop
		      htmlize
		      atom-one-dark-theme
		      org2ctex
		      org-roam-bibtex
		      org-ref
		      f
		      all-the-icons
		      ) "Default packages")

(setq package-selected-packages my/packages)

(defun my/packages-installed-p ()
  (cl-loop for pkg in my/packages
	   when (not (package-installed-p pkg)) return nil
	   finally return t))

(unless (my/packages-installed-p)
  (message "%s" "Refreshing package database...")
  (package-refresh-contents)
  (dolist (pkg my/packages)
    (when (not (package-installed-p pkg))
      (package-install pkg))))
