lisp/init-package.el

;; (use-package evil
;;   :ensure t
;;   :config
;;   (evil-mode 1))

(use-package magit
  :ensure t
  :defer t
  :bind ("C-x g" . magit-status))

(use-package counsel
  :ensure t)
(use-package swiper
  :ensure t
  :bind (
	 ("C-s" . swiper)
	 ("M-n" . next-error)
	 ("M-p" . previous-error)
	 ("C-c C-r" . ivy-resume)
	 ("M-x" . counsel-M-x)
	 ("C-x C-f" . counsel-find-file)
	 ("<f1> f" . counsel-describe-function)
	 ("<f1> v" . counsel-describe-variable)
	 ("<f1> o" . counsel-describe-symbol)
	 ("<f1> l" . counsel-find-library)
	 ("C-c g" . counsel-git)
	 ("C-c j" . counsel-git-grep)
	 )
  :config
  (ivy-mode 1)
  (setq ivy-use-virtual-buffers t
	enable-recursive-minibuffers t
	ivy-use-virtual-buffers t
	enable-recursive-minibuffers t))

(use-package company
  :ensure t
  :config
  (add-hook 'after-init-hook 'global-company-mode))

(use-package projectile
  :ensure t
  :config
  (projectile-mode +1)
  (define-key projectile-mode-map (kbd "C-c n p") 'projectile-command-map)
  (setq projectile-indexing-method 'native
	projectile-completion-system 'ivy))
